
## Plan Result (prod)




<pre><code>Plan: 0 to add, 8 to change, 0 to destroy.</code></pre>

* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
  * module.elastic.azurerm_template_deployment.elastic-iaas
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "data_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-data-asg"
      + resource_group_name = "ccd-elastic-search-prod"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "kibana_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-asg"
      + resource_group_name = "ccd-elastic-search-prod"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "cluster_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-cluster-nsg"
      + resource_group_name = "ccd-elastic-search-prod"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "kibana_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-nsg"
      + resource_group_name = "ccd-elastic-search-prod"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod"
        name       = "ccd-elastic-search-prod"
      ~ tags       = {
          - "application"         = "core-case-data"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-05-13T13:44:47Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.elastic.azurerm_template_deployment.elastic-iaas will be updated in-place
  ~ resource "azurerm_template_deployment" "elastic-iaas" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Resources/deployments/ccd-elastic-search-prod"
        name                = "ccd-elastic-search-prod"
      ~ parameters          = {
          ~ "_artifactsLocation"               = "https://raw.githubusercontent.com/hmcts/azure-marketplace/7.11.1_hmcts/src/" -> "https://raw.githubusercontent.com/hmcts/azure-marketplace/DTSPO-17635_7.11.1_hmcts/src/"
          + "dataStorageAccountType"           = "Standard"
            # (36 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - outputs        = {
                  - jumpboxssh   = {
                      - type  = "string"
                      - value = "[reference('virtual-machines').outputs.jumpboxssh.value]"
                    }
                  - kibana       = {
                      - type  = "string"
                      - value = "[reference('kibana-ip').outputs.fqdn.value]"
                    }
                  - loadbalancer = {
                      - type  = "string"
                      - value = "[reference('loadbalancer').outputs.fqdn.value]"
                    }
                }
              - parameters     = {
                  - _artifactsLocation                    = {
                      - defaultValue = "https://raw.githubusercontent.com/elastic/azure-marketplace/master/src/"
                      - metadata     = {
                          - description = "The base URI where artifacts required by this template are located, including a trailing '/'"
                        }
                      - type         = "string"
                    }
                  - _artifactsLocationSasToken            = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "The sasToken required to access _artifactsLocation. When the template is deployed using the accompanying scripts, a sasToken will be automatically generated. Use the defaultValue if the staging location is not secured."
                        }
                      - type         = "securestring"
                    }
                  - adminPassword                         = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "Admin password"
                        }
                      - type         = "securestring"
                    }
                  - adminUsername                         = {
                      - metadata = {
                          - description = "Admin username used when provisioning virtual machines"
                        }
                      - type     = "string"
                    }
                  - appGatewayCertBlob                    = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "A Base-64 encoded form of the PKCS#12 archive (.p12/.pfx) containing the key and certificate for the Application Gateway. This certificate is used to secure HTTPS connections to the Application Gateway"
                        }
                      - type         = "string"
                    }
                  - appGatewayCertPassword                = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "The password for the PKCS#12 archive (.p12/.pfx) containing the key and certificate for the Application Gateway."
                        }
                      - type         = "securestring"
                    }
                  - appGatewayCount                       = {
                      - defaultValue = 2
                      - maxValue     = 10
                      - metadata     = {
                          - description = "The number of instances of the Application Gateway. A minimum of 2 is recommended for Production clusters. Required when selecting Application Gateway for load balancing"
                        }
                      - minValue     = 1
                      - type         = "int"
                    }
                  - appGatewayEsHttpCertBlob              = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "The Base-64 encoded certificate (.cer) used to secure the HTTP layer of Elasticsearch. Used by the Application Gateway to whitelist certificates used by the backend pool. Must be set if using esHttpCertBlob to secure the HTTP layer of Elasticsearch"
                        }
                      - type         = "string"
                    }
                  - appGatewaySku                         = {
                      - allowedValues = [
                          - "Small",
                          - "Medium",
                          - "Large",
                        ]
                      - defaultValue  = "Medium"
                      - metadata      = {
                          - description = "The size of the Application Gateway. Medium or above is recommended for Production clusters, and required when using WAF tier"
                        }
                      - type          = "string"
                    }
                  - appGatewayTier                        = {
                      - allowedValues = [
                          - "Standard",
                          - "WAF",
                        ]
                      - defaultValue  = "Standard"
                      - metadata      = {
                          - description = "The tier of the Application Gateway. Required when selecting Application Gateway for load balancing"
                        }
                      - type          = "string"
                    }
                  - appGatewayWafMode                     = {
                      - allowedValues = [
                          - "Detection",
                          - "Prevention",
                        ]
                      - defaultValue  = "Detection"
                      - metadata      = {
                          - description = "The firewall mode of the Application Gateway. Required when selecting Application Gateway for load balancing and using WAF tier."
                        }
                      - type          = "string"
                    }
                  - appGatewayWafStatus                   = {
                      - allowedValues = [
                          - "Enabled",
                          - "Disabled",
                        ]
                      - defaultValue  = "Enabled"
                      - metadata      = {
                          - description = "The firewall status of the Application Gateway. Required when selecting Application Gateway for load balancing and using WAF tier."
                        }
                      - type          = "string"
                    }
                  - authenticationType                    = {
                      - allowedValues = [
                          - "password",
                          - "sshPublicKey",
                        ]
                      - defaultValue  = "password"
                      - metadata      = {
                          - description = "Choose a password or ssh public key for the Admin username used to access virtual machines"
                        }
                      - type          = "string"
                    }
                  - azureCloudPlugin                      = {
                      - allowedValues = [
                          - "Yes",
                          - "No",
                        ]
                      - defaultValue  = "No"
                      - metadata      = {
                          - description = "Choose whether to install Azure Repository plugin. The plugin allows a Azure storage account to be used for snapshot and restore. If azureCloudStorageAccountName and azureCloudStorageAccountKey are not supplied, will use the shared storage account deployed."
                        }
                      - type          = "string"
                    }
                  - azureCloudStorageAccountName          = {
                      - defaultValue = ""
                      - maxLength    = 24
                      - metadata     = {
                          - description = "The name of an existing storage account to use for snapshots with Azure Repository plugin. Must be between 3 and 24 alphanumeric lowercase or characters or numbers."
                        }
                      - type         = "string"
                    }
                  - azureCloudStorageAccountResourceGroup = {
                      - defaultValue = ""
                      - maxLength    = 90
                      - metadata     = {
                          - description = "The name of an existing resource group in which the storage account to use for snapshots with Azure Repository plugin is located. Must be 90 character or less"
                        }
                      - type         = "string"
                    }
                  - dataNodesAreMasterEligible            = {
                      - allowedValues = [
                          - "Yes",
                          - "No",
                        ]
                      - defaultValue  = "No"
                      - metadata      = {
                          - description = "Make all data nodes master-eligible. This can be useful for small Elasticsearch cluster deployments, but for larger deployments it is recommended to use dedicated master nodes"
                        }
                      - type          = "string"
                    }
                  - elasticTags                           = {
                      - defaultValue = {
                          - provider = "648D2193-0CE0-4EFB-8A82-AF9792184FD9"
                          - tracking = "pid-B2C934E3-29F3-4194-BFD2-4F1370B78E0C"
                        }
                      - metadata     = {
                          - description = "Unique identifiers to allow the Azure Infrastructure to understand the origin of resources deployed to Azure. You do not need to supply a value for this."
                        }
                      - type         = "object"
                    }
                  - esAdditionalPlugins                   = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "Additional Elasticsearch plugins to install.  Each plugin must be separated by a semicolon. e.g. analysis-icu;ingest-geoip"
                        }
                      - type         = "string"
                    }
                  - esAdditionalYaml                      = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = <<-EOT
                                Additional configuration for Elasticsearch yaml configuration file. Each line must be separated by a newline character e.g. action.auto_create_index: .security
                                indices.queries.cache.size:5%
                            EOT
                        }
                      - type         = "string"
                    }
                  - esClusterName                         = {
                      - defaultValue = "elasticsearch"
                      - metadata     = {
                          - description = "The name of the Elasticsearch cluster"
                        }
                      - type         = "string"
                    }
                  - esHeapSize                            = {
                      - defaultValue = 0
                      - metadata     = {
                          - description = "The size, in megabytes, of memory to allocate on each Elasticsearch node for the JVM heap. If unspecified, 50% of the available memory will be allocated to Elasticsearch heap, up to a maximum of 31744MB (~32GB)."
                        }
                      - type         = "int"
                    }
                  - esHttpCaCertBlob                      = {
                      - defaultValue = ""
                      - metadata     = {
                          - description = "A Base-64 encoded form of the PKCS#12 archive (.p12/.pfx) containing the CA key and certificate used to secure HTTP layer of Elasticsearch. Requires xpackPlugins be set to 'Yes' or esVersion to be >= 6.8.0 and < 7.0.0, or >= 7.1.0"
                        }
                      - type         = "string"
                    }
                  - esHttpCaCertPassword                  = {
                      - defaultValue = ""
                      - metadata     = {

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                     - storageAccountType = "Standard_LRS"
                        }
                      - Standard_G5       = {
                          - dataDisks          = 64
                          - storageAccountType = "Standard_LRS"
                        }
                      - Standard_GS1      = {
                          - dataDisks          = 8
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_GS2      = {
                          - dataDisks          = 16
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_GS3      = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_GS4      = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_GS5      = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L16s     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L16s_v2  = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L32s     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L32s_v2  = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L48s_v2  = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L4s      = {
                          - dataDisks          = 16
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L64s_v2  = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L80s_v2  = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L8s      = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_L8s_v2   = {
                          - dataDisks          = 16
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M128     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M128m    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M128ms   = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M128s    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M16ms    = {
                          - dataDisks          = 16
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M32ls    = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M32ms    = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M32ts    = {
                          - dataDisks          = 32
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64      = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64ls    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64m     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64ms    = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M64s     = {
                          - dataDisks          = 64
                          - storageAccountType = "Premium_LRS"
                        }
                      - Standard_M8ms     = {
                          - dataDisks          = 8
                          - storageAccountType = "Premium_LRS"
                        }
                    }
                  - esSettings                       = {
                      - clusterName                 = "[parameters('esClusterName')]"
                      - heapSize                    = "[parameters('esHeapSize')]"
                      - httpCaCertBlob              = "[parameters('esHttpCaCertBlob')]"
                      - httpCaCertPassword          = "[parameters('esHttpCaCertPassword')]"
                      - httpCertBlob                = "[parameters('esHttpCertBlob')]"
                      - httpCertPassword            = "[parameters('esHttpCertPassword')]"
                      - installAdditionalPlugins    = "[parameters('esAdditionalPlugins')]"
                      - installPlugins              = "[parameters('xpackPlugins')]"
                      - samlMetadataUri             = "[parameters('samlMetadataUri')]"
                      - samlServiceProviderUri      = "[parameters('samlServiceProviderUri')]"
                      - securityAdminPwd            = "[parameters('securityAdminPassword')]"
                      - securityApmPwd              = "[parameters('securityApmPassword')]"
                      - securityBeatsPwd            = "[parameters('securityBeatsPassword')]"
                      - securityBootstrapPwd        = "[if(not(empty(parameters('securityBootstrapPassword'))),parameters('securityBootstrapPassword'),uniqueString(resourceGroup().id, deployment().name, parameters('securityAdminPassword')))]"
                      - securityKibanaPwd           = "[parameters('securityKibanaPassword')]"
                      - securityLogstashPwd         = "[parameters('securityLogstashPassword')]"
                      - securityRemoteMonitoringPwd = "[parameters('securityRemoteMonitoringPassword')]"
                      - transportCaCertBlob         = "[parameters('esTransportCaCertBlob')]"
                      - transportCaCertPassword     = "[parameters('esTransportCaCertPassword')]"
                      - transportCertPassword       = "[parameters('esTransportCertPassword')]"
                      - version                     = "[parameters('esVersion')]"
                      - yamlConfiguration           = "[parameters('esAdditionalYaml')]"
                    }
                  - esVersionMajor                   = "[int(split(parameters('esVersion'), '.')[0])]"
                  - esVersionMinor                   = "[int(split(parameters('esVersion'), '.')[1])]"
                  - kibanaHttps                      = "[if(and(greater(length(parameters('kibanaKeyBlob')), 0), greater(length(parameters('kibanaCertBlob')), 0)), 'Yes', 'No')]"
                  - kibanaIpTemplateUrl              = "[uri(parameters('_artifactsLocation'), concat(variables('kibanaIpTemplates')[variables('topologySettings').kibana], parameters('_artifactsLocationSasToken')))]"
                  - kibanaIpTemplates                = {
                      - No  = "empty/empty-kibana-ip-resources.json"
                      - Yes = "empty/empty-kibana-ip-resources.json"
                    }
                  - lbBackEndPoolsAdded              = {
                      - backendPools = "[variables('backendPoolConfigurations')[parameters('loadBalancerType')]]"
                    }
                  - lbBackendPoolsRemoved            = {
                      - backendPools = []
                    }
                  - loadBalancerOptions              = {
                      - external = "external-lb-resources"
                      - gateway  = "[concat(toLower(parameters('appGatewayTier')),'-application-gateway-resources')]"
                      - internal = "internal-lb-resources"
                    }
                  - loadBalancerTemplateUrl          = "[uri(parameters('_artifactsLocation'), concat('loadbalancers/', variables('loadBalancerOptions')[parameters('loadBalancerType')],'.json', parameters('_artifactsLocationSasToken')))]"
                  - location                         = "[parameters('location')]"
                  - networkResourceGroupMap          = {
                      - existing = "[parameters('vNetExistingResourceGroup')]"
                      - new      = "[resourceGroup().name]"
                    }
                  - networkSettings                  = {
                      - addressPrefix            = "[parameters('vNetNewAddressPrefix')]"
                      - applicationGatewaySubnet = {
                          - addressPrefix = "[parameters('vNetNewAppGatewaySubnetAddressPrefix')]"
                          - name          = "[parameters('vNetAppGatewaySubnetName')]"
                        }
                      - externalSku              = "[parameters('loadBalancerExternalSku')]"
                      - https                    = "[if(and(or(greater(length(parameters('esHttpCertBlob')), 0), greater(length(parameters('esHttpCaCertBlob')), 0)), or(equals(parameters('xpackPlugins'), 'Yes'), and(greaterOrEquals(variables('esVersionMajor'), 7), greaterOrEquals(variables('esVersionMinor'), 1)), and(equals(variables('esVersionMajor'), 6), greaterOrEquals(variables('esVersionMinor'), 8)))), 'Yes', 'No')]"
                      - internalSku              = "[parameters('loadBalancerInternalSku')]"
                      - location                 = "[variables('location')]"
                      - name                     = "[parameters('vNetName')]"
                      - namespacePrefix          = "[parameters('vmHostNamePrefix')]"
                      - resourceGroup            = "[variables('networkResourceGroupMap')[parameters('vNetNewOrExisting')]]"
                      - subnet                   = {
                          - addressPrefix  = "[parameters('vNetNewClusterSubnetAddressPrefix')]"
                          - loadbalancerIp = "[variables('vNetLoadBalancerIp')]"
                          - name           = "[parameters('vNetClusterSubnetName')]"
                        }
                    }
                  - networkTemplateUrl               = "[uri(parameters('_artifactsLocation'), concat('networks/virtual-network-resources.json', parameters('_artifactsLocationSasToken')))]"
                  - newSubNetFirstAvailableAddress   = "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 4)))]"
                  - newSubNetReservedStartAddresses  = [
                      - "[variables('newSubNetStartAddress')]",
                      - "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 1)))]",
                      - "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 2)))]",
                      - "[concat(variables('newSubNetStartAddressFirstOctets'), '.', string(add(variables('newSubNetStartAddressLastOctet'), 3)))]",
                    ]
                  - newSubNetStartAddress            = "[if(equals('new', parameters('vNetNewOrExisting')), first(split(parameters('vNetNewClusterSubnetAddressPrefix'), '/')), '')]"
                  - newSubNetStartAddressFirstOctets = "[if(equals('new', parameters('vNetNewOrExisting')), substring(variables('newSubNetStartAddress'), 0, lastIndexOf(variables('newSubNetStartAddress'), '.')), '')]"
                  - newSubNetStartAddressLastOctet   = "[if(equals('new', parameters('vNetNewOrExisting')), int(last(split(variables('newSubNetStartAddress'), '.'))), 0)]"
                  - osSettingsTemplateUrl            = "[uri(parameters('_artifactsLocation'), concat('settings/ubuntuSettings.json', parameters('_artifactsLocationSasToken')))]"
                  - resolvedDataDiskCount            = "[min(variables('dataDiskOptions'))]"
                  - resolvedStorageAccountType       = "[variables('storageAccountOverrides')[parameters('storageAccountType')]]"
                  - sharedTemplateUrl                = "[uri(parameters('_artifactsLocation'), concat('partials/shared-resources.json', parameters('_artifactsLocationSasToken')))]"
                  - storageAccountOverrides          = {
                      - Default  = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].storageAccountType]"
                      - Standard = "Standard_LRS"
                    }
                  - tmpVmSizeDataDisks               = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].dataDisks]"
                  - topologySettings                 = {
                      - dataLoadBalancerBackEndPools      = "[variables('dataLoadBalancerOptions')[variables('clientResourceIndex')].backendPools]"
                      - dataNodeStorageSettings           = {
                          - accountType = "[variables('resolvedStorageAccountType')]"
                          - dataDisks   = "[variables('resolvedDataDiskCount')]"
                          - diskSize    = "[variables('dataDiskSizes')[parameters('vmDataDiskSize')]]"
                        }
                      - dataNodesAreMasterEligible        = "[parameters('dataNodesAreMasterEligible')]"
                      - jumpbox                           = "[parameters('jumpbox')]"
                      - kibana                            = "[parameters('kibana')]"
                      - kibanaCertBlob                    = "[parameters('kibanaCertBlob')]"
                      - kibanaHttps                       = "[variables('kibanaHttps')]"
                      - kibanaKeyBlob                     = "[parameters('kibanaKeyBlob')]"
                      - kibanaKeyPassphrase               = "[parameters('kibanaKeyPassphrase')]"
                      - kibanaYaml                        = "[parameters('kibanaAdditionalYaml')]"
                      - loadBalancerBackEndPools          = "[variables('lbBackEndPoolsAdded').backendPools]"
                      - logstash                          = "[parameters('logstash')]"
                      - logstashConf                      = "[parameters('logstashConf')]"
                      - logstashHeapSize                  = "[parameters('logstashHeapSize')]"
                      - logstashKeystorePwd               = "[if(not(empty(parameters('logstashKeystorePassword'))),parameters('logstashKeystorePassword'),uniqueString(resourceGroup().id, deployment().name, parameters('securityLogstashPassword')))]"
                      - logstashPlugins                   = "[parameters('logstashAdditionalPlugins')]"
                      - logstashYaml                      = "[parameters('logstashAdditionalYaml')]"
                      - vNetLoadBalancerIp                = "[variables('vNetLoadBalancerIp')]"
                      - vmClientNodeAcceleratedNetworking = "[parameters('vmClientNodeAcceleratedNetworking')]"
                      - vmClientNodeCount                 = "[parameters('vmClientNodeCount')]"
                      - vmDataNodeAcceleratedNetworking   = "[parameters('vmDataNodeAcceleratedNetworking')]"
                      - vmDataNodeCount                   = "[parameters('vmDataNodeCount')]"
                      - vmDataNodeStorageAccountType      = "[variables('dataSkuSettings')[parameters('vmSizeDataNodes')].storageAccountType]"
                      - vmHostNamePrefix                  = "[parameters('vmHostNamePrefix')]"
                      - vmKibanaAcceleratedNetworking     = "[parameters('vmKibanaAcceleratedNetworking')]"
                      - vmLogstashAcceleratedNetworking   = "[parameters('vmLogstashAcceleratedNetworking')]"
                      - vmLogstashCount                   = "[parameters('vmLogstashCount')]"
                      - vmMasterNodeAcceleratedNetworking = "[parameters('vmMasterNodeAcceleratedNetworking')]"
                      - vmSizeClientNodes                 = "[parameters('vmSizeClientNodes')]"
                      - vmSizeDataNodes                   = "[parameters('vmSizeDataNodes')]"
                      - vmSizeKibana                      = "[parameters('vmSizeKibana')]"
                      - vmSizeLogstash                    = "[parameters('vmSizeLogstash')]"
                      - vmSizeMasterNodes                 = "[parameters('vmSizeMasterNodes')]"
                    }
                  - vNetLoadBalancerIp               = "[if(equals('existing', parameters('vNetNewOrExisting')), parameters('vNetLoadBalancerIp'), if(contains(variables('newSubNetReservedStartAddresses'), parameters('vNetLoadBalancerIp')), variables('newSubNetFirstAvailableAddress'), parameters('vNetLoadBalancerIp')))]"
                }
            }
        ) -> "Error parsing JSON: invalid character ':' after top-level value"
        # (3 unchanged attributes hidden)
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":72,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->